tap "borkdude/brew"
tap "clojure-lsp/brew"
tap "clojure/tools"
tap "devlocker/tap"
tap "hmarr/tap"
tap "homebrew/bundle"
tap "jimeh/emacs-builds"

brew "aspell"
brew "awscli"
brew "bat"
brew "bazelisk"
brew "black"
brew "boot-clj"
brew "buildifier"
brew "checkmake"
brew "cksfv"
brew "clang-format"
brew "cmake"
brew "composer"
brew "editorconfig"
brew "editorconfig-checker"
brew "fastfetch"
brew "fd"
brew "git"
brew "gnupg"
brew "google-java-format"
brew "gpgme"
brew "gradle"
brew "ibazel"
brew "jdtls"
brew "jq"
brew "ktlint"
brew "leiningen"
brew "libvterm"
brew "luacheck"
brew "markdown"
brew "markdownlint-cli"
brew "maven"
brew "mg"
brew "mise"
brew "mosh"
brew "nmap"
brew "p7zip"
brew "php@8.2"
brew "planck"
brew "poetry"
brew "postgresql"
brew "pstree"
brew "pyright"
brew "rename"
brew "ripgrep"
brew "ruff"
brew "shellcheck"
brew "shfmt"
brew "sk"
brew "solargraph"
brew "sponge"
brew "starship"
brew "stow"
brew "taplo"
brew "telnet"
brew "terraform"
brew "tidy-html5"
brew "tmux"
brew "tokei"
brew "trash"
brew "tree"
brew "tree-sitter"
brew "unar"
brew "vim"
brew "viu"
brew "watch"
brew "watchexec"
brew "wget"
brew "xh"
brew "yaml-language-server"
brew "yarn"
brew "zsh"

brew "borkdude/brew/babashka"
brew "borkdude/brew/clj-kondo"
brew "borkdude/brew/jet"
brew "borkdude/brew/puget"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "clojure/tools/clojure"
brew "devlocker/tap/tychus"
brew "hmarr/tap/codeowners"

cask "appcleaner"
cask "cljstyle"
cask "coteditor"
cask "docker"
cask "emacs-app"
cask "firefox"
cask "font-comic-mono"
cask "font-departure-mono"
cask "font-iosevka-comfy"
cask "font-sf-mono"
cask "font-symbols-only-nerd-font"
cask "fontsmoothingadjuster"
cask "ghostty"
cask "gimp"
cask "handbrake"
cask "jordanbaird-ice"
cask "keyboardcleantool"
cask "mactex-no-gui"
cask "microsoft-outlook"
cask "scroll-reverser"
cask "temurin@17"
cask "visualvm"
