tap "borkdude/brew"
tap "clojure-lsp/brew"
tap "clojure/tools"
tap "devlocker/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "jimeh/emacs-builds"

brew "aspell"
brew "autoconf@2.69"
brew "bat"
brew "black"
brew "boot-clj"
brew "checkmake"
brew "cksfv"
brew "clang-format"
brew "cmake"
brew "difftastic"
brew "editorconfig"
brew "editorconfig-checker"
brew "fastfetch"
brew "fd"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "go-jsonnet"
brew "google-java-format"
brew "gradle"
brew "httpie"
brew "jdtls"
brew "jq"
brew "ktlint"
brew "kubecfg"
brew "kubernetes-cli"
brew "leiningen"
brew "luacheck"
brew "markdown"
brew "markdownlint-cli"
brew "maven"
brew "mg"
brew "mise"
brew "mosh"
brew "nmap"
brew "p7zip"
brew "planck"
brew "poetry"
brew "pstree"
brew "pyright"
brew "redis"
brew "rename"
brew "ripgrep"
brew "ruff"
brew "shellcheck"
brew "shfmt"
brew "sk"
brew "solargraph"
brew "sponge"
brew "starship"
brew "stow"
brew "stylua"
brew "taplo"
brew "telnet"
brew "tidy-html5"
brew "tmux"
brew "tokei"
brew "trash"
brew "tree"
brew "tree-sitter"
brew "unar"
brew "vim"
brew "watch"
brew "watchexec"
brew "wget"
brew "yaml-language-server"
brew "zsh"

brew "borkdude/brew/babashka"
brew "borkdude/brew/clj-kondo"
brew "borkdude/brew/jet"
brew "borkdude/brew/puget"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "clojure/tools/clojure"
brew "devlocker/tap/tychus"

cask "appcleaner"
cask "confluent-cli"
cask "coteditor"
cask "docker"
cask "emacs-app"
cask "font-comic-mono"
cask "font-departure-mono"
cask "font-symbols-only-nerd-font"
cask "fontsmoothingadjuster"
cask "google-cloud-sdk"
cask "handbrake"
cask "jordanbaird-ice"
cask "keyboardcleantool"
cask "mactex-no-gui"
cask "openlens"
cask "scroll-reverser"
cask "wezterm"
cask "visualvm"
cask "zoom"
