# frozen_string_literal: true

tap 'borkdude/brew'
tap 'clojure-lsp/brew'
tap 'clojure/tools'
tap 'devlocker/tap'
tap 'hmarr/tap'
tap 'jimeh/emacs-builds'

brew 'aspell'
brew 'atuin'
brew 'awscli'
brew 'basedpyright'
brew 'bat'
brew 'bazelisk'
brew 'black'
brew 'buildifier'
brew 'checkmake'
brew 'cksfv'
brew 'clang-format'
brew 'cmake'
brew 'composer'
brew 'docker'
brew 'editorconfig'
brew 'editorconfig-checker'
brew 'erdtree'
brew 'fastfetch'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'gitu'
brew 'gnupg'
brew 'google-java-format'
brew 'gpgme'
brew 'gradle'
brew 'gron'
brew 'helix'
brew 'hurl'
brew 'ibazel'
brew 'jdtls'
brew 'jj'
brew 'jjui'
brew 'jq'
brew 'ktlint'
brew 'leiningen'
brew 'lua-language-server'
brew 'luacheck'
brew 'markdown'
brew 'markdownlint-cli'
brew 'maven'
brew 'mise'
brew 'mosh'
brew 'nmap'
brew 'p7zip'
brew 'php@8.3'
brew 'planck'
brew 'poetry'
brew 'postgresql'
brew 'prettier'
brew 'pstree'
brew 'pyright'
brew 'rename'
brew 'ripgrep'
brew 'ruff'
brew 'sd'
brew 'shellcheck'
brew 'shfmt'
brew 'solargraph'
brew 'sponge'
brew 'starship'
brew 'stow'
brew 'stylua'
brew 'taplo'
brew 'telnet'
brew 'terraform'
brew 'tidy-html5'
brew 'tokei'
brew 'trash'
brew 'tree-sitter'
brew 'typescript-language-server'
brew 'unar'
brew 'viu'
brew 'watch'
brew 'watchexec'
brew 'wget'
brew 'xh'
brew 'yaml-language-server'
brew 'yarn'
brew 'zellij'
brew 'zoxide'
brew 'zsh'

brew 'borkdude/brew/babashka'
brew 'borkdude/brew/clj-kondo'
brew 'borkdude/brew/jet'
brew 'borkdude/brew/puget'
brew 'clojure-lsp/brew/clojure-lsp-native'
brew 'clojure/tools/clojure'
brew 'devlocker/tap/tychus'
brew 'hmarr/tap/codeowners'

cask 'appcleaner'
cask 'cljstyle'
cask 'coteditor'
cask 'dbeaver-community'
cask 'docker-desktop'
cask 'firefox'
cask 'fontsmoothingadjuster'
cask 'ghostty'
cask 'gimp'
cask 'handbrake-app'
cask 'jordanbaird-ice'
cask 'keyboardcleantool'
cask 'maccy'
cask 'mactex-no-gui'
cask 'microsoft-outlook'
cask 'rio'
cask 'scroll-reverser'
cask 'temurin@21'
cask 'visualvm'
cask 'zed'

cask 'jimeh/emacs-builds/emacs-app'
