# frozen_string_literal: true

tap 'borkdude/brew'
tap 'clojure-lsp/brew'
tap 'clojure/tools'
tap 'devlocker/tap'
tap 'jimeh/emacs-builds'

brew 'aspell'
brew 'basedpyright'
brew 'bat'
brew 'black'
brew 'checkmake'
brew 'cksfv'
brew 'clang-format'
brew 'cmake'
brew 'dotter'
brew 'editorconfig'
brew 'editorconfig-checker'
brew 'fastfetch'
brew 'fd'
brew 'fish'
brew 'fish-lsp'
brew 'fisher'
brew 'fzf'
brew 'git'
brew 'git-standup'
brew 'gitu'
brew 'gnupg'
brew 'google-java-format'
brew 'gradle'
brew 'helix'
brew 'jdtls'
brew 'jj'
brew 'jq'
brew 'just'
brew 'ktlint'
brew 'leiningen'
brew 'lua-language-server'
brew 'luacheck'
brew 'markdown'
brew 'markdownlint-cli'
brew 'maven'
brew 'mise'
brew 'mosh'
brew 'nmap'
brew 'p7zip'
brew 'planck'
brew 'pstree'
brew 'pyright'
brew 'rename'
brew 'ripgrep'
brew 'ruff'
brew 'sd'
brew 'shellcheck'
brew 'shfmt'
brew 'solargraph'
brew 'sponge'
brew 'stylua'
brew 'taplo'
brew 'telnet'
brew 'tidy-html5'
brew 'tokei'
brew 'trash'
brew 'tree'
brew 'tree-sitter'
brew 'unar'
brew 'uv'
brew 'viu'
brew 'watch'
brew 'watchexec'
brew 'wget'
brew 'xh'
brew 'yaml-language-server'
brew 'zoxide'

brew 'borkdude/brew/babashka'
brew 'borkdude/brew/clj-kondo'
brew 'borkdude/brew/jet'
brew 'borkdude/brew/puget'
brew 'clojure-lsp/brew/clojure-lsp-native'
brew 'clojure/tools/clojure'
brew 'devlocker/tap/tychus'

cask 'appcleaner'
cask 'coteditor'
cask 'font-symbols-only-nerd-font'
cask 'fontsmoothingadjuster'
cask 'foobar2000'
cask 'ghostty'
cask 'handbrake-app'
cask 'iina'
cask 'jordanbaird-ice'
cask 'keyboardcleantool'
cask 'mactex-no-gui'
cask 'scroll-reverser'
cask 'signal'
cask 'simple-comic'
cask 'spotify'
cask 'subler'
cask 'temurin@21'
cask 'xld'

cask 'jimeh/emacs-builds/emacs-app'
