# frozen_string_literal: true

tap 'borkdude/brew'
tap 'clojure-lsp/brew'
tap 'clojure/tools'
tap 'd12frosted/emacs-plus'
tap 'hmarr/tap'

brew 'aspell'
brew 'awscli'
brew 'basedpyright'
brew 'bat'
brew 'bazelisk'
brew 'black'
brew 'buildifier'
brew 'checkmake'
brew 'cksfv'
brew 'clang-format'
brew 'cmake'
brew 'composer'
brew 'docker'
brew 'dotter'
brew 'editorconfig'
brew 'editorconfig-checker'
brew 'eslint'
brew 'fastfetch'
brew 'fd'
brew 'fish'
brew 'fish-lsp'
brew 'fisher'
brew 'fzf'
brew 'git'
brew 'git-standup'
brew 'gitu'
brew 'gnupg'
brew 'google-java-format'
brew 'gpgme'
brew 'gradle'
brew 'gron'
brew 'helix'
brew 'hurl'
brew 'ibazel'
brew 'imagemagick'
brew 'jdtls'
brew 'jj'
brew 'jq'
brew 'just'
brew 'ktlint'
brew 'leiningen'
brew 'markdown'
brew 'markdownlint-cli'
brew 'maven'
brew 'mise'
brew 'pgformatter'
brew 'php@8.3'
brew 'pkg-config'
brew 'postgresql'
brew 'prettier'
brew 'pstree'
brew 'rename'
brew 'ripgrep'
brew 'ruff'
brew 'shellcheck'
brew 'shfmt'
brew 'solargraph'
brew 'sponge'
brew 'taplo'
brew 'terraform'
brew 'tflint'
brew 'tidy-html5'
brew 'tokei'
brew 'tree'
brew 'tree-sitter'
brew 'typescript-language-server'
brew 'unar'
brew 'uv'
brew 'viu'
brew 'watch'
brew 'watchexec'
brew 'wget'
brew 'xh'
brew 'yaml-language-server'
brew 'yarn'
brew 'zoxide'

brew 'borkdude/brew/babashka'
brew 'borkdude/brew/clj-kondo'
brew 'borkdude/brew/jet'
brew 'clojure-lsp/brew/clojure-lsp-native'
brew 'clojure/tools/clojure'
brew 'hmarr/tap/codeowners'

cask 'appcleaner'
cask 'cljstyle'
cask 'coteditor'
cask 'docker-desktop'
cask 'font-symbols-only-nerd-font'
cask 'fontsmoothingadjuster'
cask 'ghostty'
cask 'gimp'
cask 'handbrake-app'
cask 'helium-browser'
cask 'jordanbaird-ice'
cask 'keyboardcleantool'
cask 'mactex-no-gui'
cask 'scroll-reverser'
cask 'temurin@21'
cask 'visualvm'

cask 'd12frosted/emacs-plus/emacs-plus-app'
