# frozen_string_literal: true

brew 'aspell'
brew 'awscli'
brew 'basedpyright'
brew 'bat'
brew 'bazelisk'
brew 'black'
brew 'buildifier'
brew 'checkmake'
brew 'cksfv'
brew 'clang-format'
brew 'cljfmt'
brew 'cmake'
brew 'difftastic'
brew 'composer'
brew 'dotter'
brew 'ec'
brew 'editorconfig'
brew 'editorconfig-checker'
brew 'eslint'
brew 'fastfetch'
brew 'fd'
brew 'fish'
brew 'fish-lsp'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gitu'
brew 'gnupg'
brew 'google-java-format'
brew 'gpgme'
brew 'gradle'
brew 'gron'
brew 'helix'
brew 'hurl'
brew 'ibazel'
brew 'imagemagick'
brew 'jdtls'
brew 'jj'
brew 'jq'
brew 'just'
brew 'just-lsp'
brew 'ktlint'
brew 'leiningen'
brew 'maven'
brew 'mise'
brew 'oxlint'
brew 'pdm'
brew 'pgformatter'
brew 'php@8.3'
brew 'phpantom-lsp'
brew 'pkg-config'
brew 'postgresql'
brew 'prettier'
brew 'pstree'
brew 'rename'
brew 'ripgrep'
brew 'ruff'
brew 'rumdl'
brew 'shellcheck'
brew 'shfmt'
brew 'solargraph'
brew 'sponge'
brew 'taplo'
brew 'terraform'
brew 'tflint'
brew 'tidy-html5'
brew 'tinymist'
brew 'tokei'
brew 'tree'
brew 'tree-sitter'
brew 'typst'
brew 'typescript-language-server'
brew 'unar'
brew 'viu'
brew 'watch'
brew 'watchexec'
brew 'wget'
brew 'xh'
brew 'yaml-language-server'
brew 'yarn'

brew 'borkdude/brew/babashka', trusted: true
brew 'borkdude/brew/clj-kondo', trusted: true
brew 'borkdude/brew/jet', trusted: true
brew 'clojure-lsp/brew/clojure-lsp-native', trusted: true
brew 'clojure/tools/clojure', trusted: true
brew 'datadog-labs/pack/pup', trusted: true
brew 'hmarr/tap/codeowners', trusted: true
brew 'neurosnap/tap/zmx', trusted: true

cask 'appcleaner'
cask 'claude-code'
cask 'cljstyle'
cask 'coteditor'
cask 'docker-desktop'
cask 'font-symbols-only-nerd-font'
cask 'fontsmoothingadjuster'
cask 'ghostty'
cask 'gimp'
cask 'handbrake-app'
cask 'helium-browser'
cask 'hyperkey'
cask 'jordanbaird-ice'
cask 'keyboardcleantool'
cask 'kotlin-lsp'
cask 'scroll-reverser'
cask 'skim'
cask 'visualvm'

cask 'd12frosted/emacs-plus/emacs-plus-app', trusted: true
